[
  "buttons",
  "calendar",
  "omnisearch",
  "codeblock-tabs",
  "code-styler",
  "obsidian-plugin-toc",
  "obsidian-style-settings",
  "obsidian-charts",
  "dataview",
  "obsidian-book-search-plugin"
]