[
  "buttons",
  "calendar",
  "omnisearch",
  "codeblock-tabs",
  "code-styler",
  "obsidian-plugin-toc",
  "obsidian-charts",
  "dataview",
  "obsidian-book-search-plugin",
  "page-gallery",
  "card-board",
  "execute-code",
  "find-orphaned-images"
]